placeholder/dbl_0_58_49_6/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0 1.5 0)
    (0 1 0)
    (0 0.42 0)
    (0 0 0)
    (0.2 1.5 0)
    (0.2 1 0)
    (0.2 0.42 0)
    (0.2 0 0)
    (0.675 1 0)
    (0.675 0.42 0)
    (0.675 0 0)
    (0.725 1 0)
    (0.725 0.42 0)
    (0.725 0 0)
    (2.275 1 0)
    (2.275 0.42 0)
    (2.275 0 0)
    (2.325 1 0)
    (2.325 0.42 0)
    (2.325 0 0)
    (2.8 1.5 0)
    (2.8 1 0)
    (2.8 0.42 0)
    (2.8 0 0)
    (3 1.5 0)
    (3 1 0)
    (3 0.42 0)
    (3 0 0)
    (0 1.5 -0.01)
    (0 1 -0.01)
    (0 0.42 -0.01)
    (0 0 -0.01)
    (0.2 1.5 -0.01)
    (0.2 1 -0.01)
    (0.2 0.42 -0.01)
    (0.2 0 -0.01)
    (0.675 1 -0.01)
    (0.675 0.42 -0.01)
    (0.675 0 -0.01)
    (0.725 1 -0.01)
    (0.725 0.42 -0.01)
    (0.725 0 -0.01)
    (2.275 1 -0.01)
    (2.275 0.42 -0.01)
    (2.275 0 -0.01)
    (2.325 1 -0.01)
    (2.325 0.42 -0.01)
    (2.325 0 -0.01)
    (2.8 1.5 -0.01)
    (2.8 1 -0.01)
    (2.8 0.42 -0.01)
    (2.8 0 -0.01)
    (3 1.5 -0.01)
    (3 1 -0.01)
    (3 0.42 -0.01)
    (3 0 -0.01)
);
blocks
( 
    hex (0 4 5 1 28 32 33 29) (10 20 1) simpleGrading (1 1 1)
    hex (1 5 6 2 29 33 34 30) (10 23 1) simpleGrading (1 1 1)
    hex (2 6 7 3 30 34 35 31) (10 17 1) simpleGrading (1 1 1)
    hex (5 8 9 6 33 36 37 34) (25 23 1) simpleGrading (1 1 1)
    hex (6 9 10 7 34 37 38 35) (25 17 1) simpleGrading (1 1 1)
    //hex (8 11 12 9 36 39 40 37) (3 20 1) simpleGrading (1 1 1)
    hex (9 12 13 10 37 40 41 38) (3 17 1) simpleGrading (1 1 1)
    hex (11 14 15 12 39 42 43 40) (80 23 1) simpleGrading (1 1 1)
    hex (12 15 16 13 40 43 44 41) (80 17 1) simpleGrading (1 1 1)
    //hex (14 17 18 15 42 45 46 43) (3 20 1) simpleGrading (1 1 1)
    hex (15 18 19 16 43 46 47 44) (3 17 1) simpleGrading (1 1 1)
    hex (17 21 22 18 45 49 50 46) (25 23 1) simpleGrading (1 1 1)
    hex (18 22 23 19 46 50 51 47) (25 17 1) simpleGrading (1 1 1)
    hex (20 24 25 21 48 52 53 49) (10 20 1) simpleGrading (1 1 1)
    hex (21 25 26 22 49 53 54 50) (10 23 1) simpleGrading (1 1 1)
    hex (22 26 27 23 50 54 55 51) (10 17 1) simpleGrading (1 1 1)
);
edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 28 32)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (20 24 52 48)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 28 29 1)
            (1 29 30 2)
            (2 30 31 3)
            (3 31 35 7)
            (7 35 38 10)
            (10 38 41 13)
            (13 41 44 16)
            (16 44 47 19)
            (19 47 51 23)
            (23 51 55 27)
            (26 27 55 54)
            (25 26 54 53)
            (24 25 53 52)
            (20 48 49 21)
            (17 21 49 45)
            (11 14 42 39)
(5 8 36 33)
            (33 32 4 5)
        );
    }
    baffle
    {
        type wall;
        faces
        (
            (37 36 8 9)
            (9 37 40 12)
            (11 12 40 39)
            (42 43 15 14)
            (15 43 46 18)
            (17 18 46 45)
        );
    }
    front
    {
        type empty;
        faces
        (
            (5 4 0 1)
            (6 5 1 2)
            (7 6 2 3)
            (9 8 5 6)
            (10 9 6 7)
//(12 11 8 9)
            (13 12 9 10)
            (15 14 11 12)
            (16 15 12 13)
            //(18 17 14 15)
            (19 18 15 16)
            (22 21 17 18)
            (23 22 18 19)
            (25 24 20 21)
            (26 25 21 22)
            (27 26 22 23)

        );
   }
   back
   {
        type empty;
        faces
        (
            (28 32 33 29)
            (29 33 34 30)
            (30 34 35 31)
            (33 36 37 34)
            (34 37 38 35)
            //(36 39 40 37)
            (37 40 41 38)
            (39 42 43 40)
            (40 43 44 41)
            //(42 45 46 43)
            (43 46 47 44)
            (45 49 50 46)
            (46 50 51 47)
            (48 52 53 49)
            (49 53 54 50)
            (50 54 55 51)
        );
   }
);


mergePatchPairs
(
);

// ************************************************************************* //
